export const SERVERS = [
    '스카니아', 
    '베라', 
    '루나', 
    '제니스', 
    '크로아', 
    '유니온', 
    '엘리시움', 
    '이노시스', 
    '레드', 
    '오로라', 
    '아케인', 
    '노바',
    '에오스',
    '헬리오스',
    '챌린저스',
]
export const SERVER_IMAGES: Record<string, string> = {
    '스카니아': '/images/스카니아.png',
    '베라': '/images/베라.png',
    '루나': '/images/루나.png',
    '제니스': '/images/제니스.png',
    '크로아': '/images/크로아.png',
    '유니온': '/images/유니온.png',
    '엘리시움': '/images/엘리시움.png',
    '이노시스': '/images/이노시스.png',
    '레드': '/images/레드.png',
    '오로라': '/images/오로라.png',
    '아케인': '/images/아케인.png',
    '노바': '/images/노바.png',
    '에오스': '/images/에오스.png',
    '헬리오스': '/images/헬리오스.png',
    '챌린저스': '/images/챌린저스.png',
}

export const JOBS = [
    '히어로', '팔라딘', '다크나이트',  // 초보자 전사
    '아크메이지(불,독)', '아크메이지(썬,콜)', '비숍',  // 초보자 마법사
    '보우마스터', '신궁', '패스파인더',  // 초보자 궁수
    '나이트로드', '섀도어', '듀얼블레이드', // 초보자 도적
    '바이퍼', '캡틴', '캐논슈터', // 초보자 해적
    '소울마스터', '플레임위자드', '윈드브레이커', '나이트워커','스트라이커', '미하일', // 시그너스 기사단
    '블래스터', '배틀메이지', '와일드헌터', '메카닉','제논', // 레지스탕스
    '아란', '에반', '메르세데스', '팬텀', '은월', '루미너스', // 영웅
    '데몬슬레이어', '데몬어벤져', // 데몬
    '카이저', '카인', '카데나', '엔젤릭버스터', // 노바
    '제로', // 초월자
    '키네시스', // 프렌즈 월드
    '아델', '일리움', '칼리', '아크',  // 레프
    '호영', '라라', '렌' // 아니마
]

export type Boss = {
    name: string
    reward: number  // 골드
}

export const BOSSES: Boss[] = [
    { name: '자쿰', reward: 50000 },
    { name: '핑크빈', reward: 80000 },
    { name: '매그너스', reward: 120000 },
    { name: '힐라', reward: 100000 },
    { name: '데미안', reward: 300000 },
    { name: '루시드', reward: 350000 },
    { name: '윌', reward: 350000 },
    { name: '더스크', reward: 280000 },
    { name: '진 힐라', reward: 280000 },
    { name: '세렌', reward: 400000 },
    { name: '칼로스', reward: 450000 },
    { name: '보스 카링', reward: 500000 },
]